perf/sync/border6.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Start
      duration: 5
      arrivalRate: 1
    - name: Positive Ramp
      duration: 10
      arrivalRate: 1
      rampTo: 5
    - name: Sublimit
      duration: 60
      arrivalRate: 5
    - name: Overlimit
      duration: 120
      arrivalRate: 6

scenarios:
  - name: Bbox-9090
    flow:
      - get:
          url: '/sync'