perf/sync/heartbeat.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Heartbeat
      duration: 120
      arrivalRate: 1

scenarios:
  - name: Bbox-9090
    flow:
      - get:
          url: '/sync'